"""
題目：4
請印出下列形式的九九乘法表。
(注意！第一直行的格式與其他行不同，其乘法結果僅有一位數。)
-------------------------------------------------------------
                                                       1x9= 9 
                                                2x8=16 2x9=18 
                                         3x7=21 3x8=24 3x9=27 
                                  4x6=24 4x7=28 4x8=32 4x9=36 
                           5x5=25 5x6=30 5x7=35 5x8=40 5x9=45 
                    6x4=24 6x5=30 6x6=36 6x7=42 6x8=48 6x9=54 
             7x3=21 7x4=28 7x5=35 7x6=42 7x7=49 7x8=56 7x9=63 
      8x2=16 8x3=24 8x4=32 8x5=40 8x6=48 8x7=56 8x8=64 8x9=72 
9x1=9 9x2=18 9x3=27 9x4=36 9x5=45 9x6=54 9x7=63 9x8=72 9x9=81 
------------------------------------------------------------- 
"""
index = 9
for i in range(1, 10):
    for j in  range(1, 10):
        if (i * j < 10) and (j == 1)and j < index:
            print(f'     ', end= " ")
        elif j < index:
            print(f'      ', end= " ")
        elif (i * j < 10) and j > 1:
            print(f'{i}x{j}= {i * j}', end= " ")
        else:
            print(f'{i}x{j}={i * j}', end= " ")
    index -= 1
    print()